#include <stdio.h>
int main()
{

    // 优先级： 算术运算符 -> 关系运算符 -> 赋值运算符
    int x = 3, y = 5, z = 6;
    printf("%d %d\n", x > y + 2, x > (y + 2));                 // equal
    printf("%d %d %d\n", y = x > 2, y = (x > 2), (y = x) > 2); //y = x > 2 等价于 y = (x > 2)

    //优先级
    /*
		   运算符		  						            结合律 
			1.()		  						           从左往右 
			2.+ - ++ -- sizeof（一元，即正负号）		    从右往左 
			3.* /  %	  						           从左往右 
			4.+ - （二元，即加减）		  		            从左往右 
			5.< > <= >=		  						       从左往右 
			6.== !=                                        从左往右
            7.= *= /= %= += -=                                          从右往左
			如，-8就是从右往左，8与负号结合
			9-8 是从左往右结合 
	*/
    x = 2, y = 3, z = 4;
    x *= 3 * y + 5; // x=x*(3*y+5)
    printf("%d\n", x);
    x = 2;
    x *= y + z; //x=x*(y+z)
    printf("%d\n", x);

    //, 运算符 从左往右运算
    int a, b, c;
    a = 249, 500;
    b = (249, 500);
    printf("%d %d\n", a, b);
    c = (a = 3, (b = ++a + 2) + 5);
    printf("%d %d %d\n", a, b, c);
    
    getchar();
    return 0;
}